import React from 'react'
import Link from 'gatsby-link'
import Sidebar from '../components/Sidebar';
import LazyImg from '../components/LazyImg';
import Animate from '../components/Animate';
import './p5.css'

const anchors = [{ 
  id: '51', label: '简介'
}, {
  id: '52', label: '登录流程',
}, {
  id: '520', label: null
}, {
  id: '53', label: '外勤打卡'
}, {
  id: '530', label: null
},{
  id: '54', label: '采集任务'
}, {
  id: '540', label: null
}, {
  id: '55', label: '新闻版块'
}, {
  id: '550', label: null
}];

const triggerSelectors = [
  '.简介5', '.登录流程', '.外勤打卡',  '.采集任务分析', '.采集任务结果', 
  '.新闻设计要点一','.新闻设计要点二2','.新闻最终方案'
  
]; 

const p5 = () => (
  <div>
  <Sidebar anchors={anchors}/>
  <Animate triggerSelectors={triggerSelectors}/>

  <div className="content5">
    <a name="51"></a> <h1>SenseHello更新迭代</h1>
    <div className="简介5" id="51">
    <LazyImg src={require('../image/sensehi更新迭代.png')} width="480px" height="431px"/>
      <p id="简介5">简介</p>
      <p id="简介内容5">SenseHello是基于公司研发的人脸识别技术，商汤内部员工刷脸打卡考勤软件。产品处于前期引入期，功能还不够完善，通过更新迭代，优化体验，完善功能。到今年八月份，一共完成了三次更新迭代，并预计在九月份完成第四次更新迭代：1)优化登录及外勤打卡流程；2)发现板块 “任务”界面设计；3)发现板块“黑科技”界面设计；4)发现板块“新闻”界面设计。</p>
      <p id="时间5">时间</p>
      <p id="时间内容5">2019/02-2019/09</p>
      <p id="角色和工作5">角色和工作</p>
     <p id="角色和工作内容5">交互设计师负责APP交互设计</p>
    </div>

    <div className="登录流程">
     <a name="52"></a><h1>01</h1>
      <h2 id="52">需求分析</h2>
      <p>对登录流程进行优化，简化流程，提高效率，并优化头像录入过程，给用户更多自主权，减少后续修改头像步骤。</p>
      <LazyImg  src={require('../image/登录流程.png')} width="850px" height="1416px"/>
      <div style={{position: 'relative', left:'100px'}}>
        <div id="520"></div>
      </div>
    </div>

    <div className="外勤打卡">
      <a name="53"></a><h1>02</h1>
      <h2 id="53">外勤打卡</h2>
      <p id="外勤打卡优化">对外勤打卡流程进行优化，减少用户输入操作，提高外勤打卡效率。</p>
      <LazyImg  src={require('../image/外勤打卡.png')} width="950px" height="553px"/>
      <p id="外勤打卡优化前">每次外勤打卡都需要填写理由。若为同一次出勤，则需要多次填写一样的内容，降低外勤打卡效率。</p>
      <p id="外勤打卡优化后">根据后台外勤事由数据，选择事由出现次数最多的五项，用户可直接选择外勤事由，并选填补充事由，提高外勤打卡效率。</p>
      <div style={{position: 'relative', left:'100px'}}>
        <div id="530"></div>
      </div>
    </div>

    <div className="采集任务">
      <a name="54"></a><h1>03</h1>
      <h2 id="54">采集任务</h2>
      <div className="采集任务分析"> 
      <svg t="1567302259478" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1951" width="25" height="25" data-spm-anchor-id="a313x.7781069.0.i6"><path d="M691.9 484.2H330.8c-23 0-41.7 18.8-41.7 42s18.7 42 41.7 42h361.1c23 0 41.7-18.8 41.7-42s-18.7-42-41.7-42m0 196H330.8c-23 0-41.7 18.8-41.7 42s18.7 42 41.7 42h361.1c23 0 41.7-18.8 41.7-42 0-23.1-18.7-42-41.7-42m205.2-505.7c21.7-21.9 21.7-57.3 0-79.2a55.231 55.231 0 0 0-39.3-16.4c-14.8 0-28.9 5.9-39.3 16.4L662.4 252.7l78.6 79.2 156.1-157.4zM330.8 372.2h138.9c23 0 41.7-18.8 41.7-42s-18.7-42-41.7-42H330.8c-23 0-41.7 18.8-41.7 42s18.7 42 41.7 42m373.2-3.1l17.3-17.5-78.6-79.2-17.3 17.5c-21.7 21.9-21.7 57.3 0 79.2 10.4 10.5 24.5 16.4 39.3 16.4 14.8 0 28.9-5.9 39.3-16.4" p-id="1952"></path><path d="M844.7 344.2v476c0 30.9-24.9 56-55.6 56H233.5c-30.7 0-55.6-25.1-55.6-56v-616c0-30.9 24.9-56 55.6-56h416.7v-84H178c-46 0-83.3 37.6-83.3 84v728c0 46.4 37.3 84 83.3 84h666.7c46 0 83.3-37.6 83.3-84v-532h-83.3z" p-id="1953" data-spm-anchor-id="a313x.7781069.0.i7" class="selected"></path></svg> 
      <p id="采集需求背景">需求背景</p>
      <p id="采集需求背景内容">采集部门希望通过采集任务来提高员工参加采集活动的积极性，需要设计一个采集任务积分界面。</p>

      <svg  t="1567302335714" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3064" width="24" height="24"><path d="M513 1019c-68.3 0-134.6-13.4-197-39.8-60.3-25.5-114.4-62-160.8-108.4C108.7 824.3 72.3 770.2 46.8 710 20.4 647.6 7 581.3 7 513s13.4-134.6 39.8-197c25.5-60.3 62-114.4 108.4-160.8C201.7 108.7 255.8 72.3 316 46.8 378.4 20.4 444.7 7 513 7c47.8 0 95.1 6.7 140.6 19.8 21.2 6.1 33.5 28.3 27.3 49.5-6.1 21.2-28.3 33.5-49.5 27.3C593.1 92.6 553.3 87 513 87 278.1 87 87 278.1 87 513s191.1 426 426 426 426-191.1 426-426c0-43.7-6.6-86.8-19.6-128-6.6-21.1 5.1-43.5 26.2-50.2 21.1-6.6 43.5 5.1 50.2 26.2 15.4 49 23.2 100.2 23.2 152 0 68.3-13.4 134.6-39.8 197-25.5 60.3-62 114.4-108.4 160.8S770.2 953.7 710 979.2c-62.4 26.4-128.7 39.8-197 39.8z" fill="" p-id="3065"></path><path d="M516 757c-64.9 0-125.9-25.3-171.8-71.2C298.3 639.9 273 578.9 273 514s25.3-125.9 71.2-171.8C390.1 296.3 451.1 271 516 271c18.3 0 36.5 2 54.1 6.1 21.5 4.9 35 26.3 30.1 47.9-4.9 21.5-26.3 35-47.9 30.1-11.8-2.7-24.1-4.1-36.4-4.1-89.9 0-163 73.1-163 163s73.1 163 163 163 163-73.1 163-163c0-13.6-1.7-27-4.9-40-5.4-21.4 7.6-43.2 29-48.6 21.4-5.4 43.2 7.6 48.6 29 4.9 19.4 7.4 39.4 7.4 59.6 0 64.9-25.3 125.9-71.2 171.8S580.9 757 516 757zM816.7 114.1c9.9 46.6 46.7 83.6 93.2 93.7l-66.6 66.6c-15.1-7.5-31.8-12.3-49-14.1l-27.4-2.8-2.9-27.9c-1.8-17.1-6.6-33.7-14.1-48.8l66.8-66.7m20.6-113c-12.1 0-24.3 4.3-34.4 13.7-0.5 0.5-1 0.9-1.5 1.4L682.6 135.1c-20.5 20.5-23.1 52.2-7.7 75.4 5.4 8.2 8.6 17.7 9.6 27.5l6.2 59.1c2 19.5 17.5 34.9 37 36.9l58.6 5.9c9.8 1 19.2 4.1 27.4 9.5 10 6.6 21.5 9.9 33 9.9 15.4 0 30.7-5.9 42.4-17.6L1008 222.9c0.5-0.5 1-1 1.4-1.5 29.1-31.1 9.1-82.3-33.4-86.6l-44.7-4.5c-19.5-2-35-17.4-37-36.9L889.5 48c-2.9-28.5-27.2-46.9-52.2-46.9z" fill="" p-id="3066"></path><path d="M510.8 553.5c-10.2 0-20.5-3.9-28.3-11.7-15.6-15.6-15.6-40.9 0-56.6l292.7-292.7c15.6-15.6 40.9-15.6 56.6 0s15.6 40.9 0 56.6L539.1 541.7c-7.8 7.9-18 11.8-28.3 11.8z" fill="" p-id="3067"></path></svg>
      <p id="采集用户目标">用户目标</p>
      <p id="采集用户目标内容">快速完成任务获取奖励</p>


      <svg  t="1567302528954" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="7442" width="26" height="26"><path d="M823.1 948.4l-0.9 1.8c-10.7 20-35.5 27.5-55.4 16.8L529 840c-20-10.7-27.5-35.5-16.8-55.4l0.9-1.8c10.7-20 35.5-27.5 55.4-16.8l237.8 127c20 10.6 27.5 35.4 16.8 55.4z" fill="#242424" p-id="7443"></path><path d="M957.1 371.8l-261.5-38c-13.1-1.9-24.5-10.2-30.4-22.1l-117-237c-14.8-30-57.6-30-72.4 0l-117 237c-5.9 11.9-17.2 20.2-30.4 22.1l-261.5 38c-33.1 4.8-46.3 45.5-22.4 68.9l189.3 184.5c9.5 9.3 13.9 22.6 11.6 35.7l-44.7 260.5c-5.7 33 29 58.1 58.6 42.6l233.9-123c11.8-6.2 25.8-6.2 37.6 0l111 58.4-9.3-92.5 12.6 0.1-127.2-67.2c-1.7-0.9-3.7-0.9-5.4 0L308.3 847c-4.2 2.2-9.2-1.4-8.4-6.1l39-224.4c0.3-1.9-0.3-3.8-1.7-5.1L172 450.4c-3.4-3.3-1.5-9.1 3.2-9.8l228.3-33.2c1.9-0.3 3.5-1.5 4.3-3.2L510 197.4c2.1-4.3 8.2-4.3 10.3 0l102.1 206.9c0.8 1.7 2.5 2.9 4.3 3.2L855 440.7c4.7 0.7 6.6 6.5 3.2 9.8L689 611.5c-1.4 1.3-2 3.2-1.7 5.1l31.5 181.1 81.8-7.8-22.1-129c-2.2-13.1 2.1-26.5 11.6-35.7l189.3-184.5c24.1-23.4 10.8-64.1-22.3-68.9z" fill="#242424" p-id="7444"></path><path d="M759.9 793.2m-40.9 0a40.9 40.9 0 1 0 81.8 0 40.9 40.9 0 1 0-81.8 0Z" fill="#242424" p-id="7445"></path></svg>
      <p id="采集用户关注">用户关注</p>
      <p id="采集用户关注内容">1、效率 —— 每个人完成任务所需时长<br />2、完成任务获取奖励 —— 每项任务的奖励值<br />3、时间地点信息不容易记住，用户不关心，采集人会来找你采集数据，员工并不需要知道时间和地点信息。</p>


      <svg t="1567302455516" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5517" width="24" height="24"><path d="M977.454545 1024 46.545455 1024C20.829091 1024 0 1003.170909 0 977.454545L0 46.545455C0 20.829091 20.829091 0 46.545455 0L977.454545 0C1003.170909 0 1024 20.829091 1024 46.545455L1024 977.454545C1024 1003.170909 1003.170909 1024 977.454545 1024ZM930.909091 139.636364C930.909091 113.92 910.08 93.090909 884.363636 93.090909L139.636364 93.090909C113.92 93.090909 93.090909 113.92 93.090909 139.636364L93.090909 279.272727 930.909091 279.272727 930.909091 139.636364ZM930.909091 372.363636 93.090909 372.363636 93.090909 884.363636C93.090909 910.08 113.92 930.909091 139.636364 930.909091L884.363636 930.909091C910.08 930.909091 930.909091 910.08 930.909091 884.363636L930.909091 372.363636ZM558.545455 139.636364C584.261818 139.636364 605.090909 160.465455 605.090909 186.181818 605.090909 211.898182 584.261818 232.727273 558.545455 232.727273 532.829091 232.727273 512 211.898182 512 186.181818 512 160.465455 532.829091 139.636364 558.545455 139.636364ZM698.181818 139.636364C723.898182 139.636364 744.727273 160.465455 744.727273 186.181818 744.727273 211.898182 723.898182 232.727273 698.181818 232.727273 672.465455 232.727273 651.636364 211.898182 651.636364 186.181818 651.636364 160.465455 672.465455 139.636364 698.181818 139.636364ZM837.818182 139.636364C863.534545 139.636364 884.363636 160.465455 884.363636 186.181818 884.363636 211.898182 863.534545 232.727273 837.818182 232.727273 812.101818 232.727273 791.272727 211.898182 791.272727 186.181818 791.272727 160.465455 812.101818 139.636364 837.818182 139.636364Z" p-id="5518"></path></svg>
      <p  id="采集结果呈现">结果呈现</p>
      <p  id="采集结果呈现内容">1、任务列表突出奖励值和任务时长，卡片中间弱化的信息为时间和地点信息，卡片整体看起来简洁有重点。<br />2、点击卡片即可参与任务，简化参与流程。</p>
      </div>
      
      <div className="采集任务结果"><LazyImg  src={require('../image/采集任务结果.png')} width="950px" height="341px"/></div>
      <div style={{position: 'relative', left:'100px'}}>
        <div id="540"></div>
      </div>
    </div>


    <div className="新闻模块">
      <div className="新闻设计要点一"><a name="45"></a><h1>04</h1>
      <h2 id="55">新闻模块</h2>
      <p id="新闻产品需求">产品需求：发现界面新增新闻模块，放置与公司相关的新闻，丰富产品功能及内容，提高SenseHello的使用率。</p>
      <h3>设计要点一</h3>
      <LazyImg id="新闻设计要点一图片" src={require('../image/新闻设计要点1.png')} width="548px" height="452px"/>
      <p id="新闻设计要点一">1.如何让用户快速进入新闻界面，浏览新闻：<br />新闻模块入口层级较深，需要从发现页面点击进入，且目前发现模块加载速度较慢，用户缺乏耐心等待。以推送的形式在首页推送新闻，点击推送可快速进入新闻版块查看新闻详情<br /><br />2.推送的时间是关键：<br />用户打开SenseHello的首要目的是打卡，若在打卡前推送将会被用户忽略。将推送设置在用户打卡完成后，显示推送，强化【去看看】按钮，引导用户查看新闻。</p></div>
      <div className="新闻设计要点二"><h4>设计要点二</h4>
      <p>新闻列表应该如何设计，能够提高用户的新闻浏览阅读速度，提高效率。</p>
      <LazyImg  src={require('../image/思考一.png')} width="950px" height="400px"/></div>
      <div className="新闻设计要点二2"><LazyImg  src={require('../image/思考二.png')} width="950px" height="394px"/></div>
      <div className="新闻最终方案"><h5>最终方案</h5>
      <LazyImg  src={require('../image/新闻最终方案.png')} width="950px" height="320px"/></div>
      <div style={{position: 'relative', left:'100px'}}>
        <div id="550"></div>
      </div>
    </div>


    <div className="翻页51">
      <Link to="/p4" ><button >上一篇</button></Link></div>
    <div className="翻页52"> <Link to="/p6" ><button >下一篇</button></Link></div>
    <div id="550"></div>
    <div className="Footer5"> ©️2019 by Joya Zheng </div>
  </div>
</div>
)

export default p5
